<template>
  <div class="guideDetail">
      <div class="head">
        <h2>{{guidContent.name}}</h2>
        <p>{{guidContent.time}}</p>
      </div>
      <p class="pageText">{{guidContent.text}}</p>
  </div>
</template>
<script>
export default {
  name: 'GuideDetail',
  data () {
    return {
      guidContent: {},
      guidDetailList: [
        { name: '被征地农民退保',
          time: '2016-06-11',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-12',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-13',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-14',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-15',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-16',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-17',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-18',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-19',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-20',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-21',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        },
        { name: '被征地农民退保',
          time: '2016-06-22',
          text: '临安中医院是一所集中医、西医、中西医结合医疗、预防、保健、康复、科研教学为一体的，具有中医特色并与现代医学技术相结合的二级甲等综合性中医医院。是浙江省中医“名院”建设单位，临安市糠尿病强化治疗中心、临安市肿瘤防治中心，中国健康扶贫定点医院，临安市惠民医院，ISO9000国际质量管理体系认证单位。'
        }
      ]
    }
  },
  computed: {
  },
  created () {
    window.scope = this
    this.$store.commit('changeHeaderTitle', '办事指南')
    this.guidText(this.$route.params.id)
  },
  methods: {
    guidText (id) {
      this.guidContent = this.guidDetailList[id]
    }
  }
}
</script>
<style lang="scss" scoped>
.guideDetail{
  padding: 1.2rem $font-size3 0 $font-size3;
  color: $color-font1;
  font-size: $font-size3;
  min-height: calc(100% - 2.75rem);
  background: #fff;
  .head{
    border-bottom:1px dotted #d1d3d5;
    h2{
      font-size: 0.9rem;
      color: $color-font2;
      font-weight: 600;
    }
    p{
      padding: 0.4rem 0;
      color: $color-font7;
      font-size: 0.65rem;
    }
  }
  .pageText{
    padding-top: 0.2rem;
    text-indent:2em;
    line-height: 1.5;
  }
}
</style>
